[{"id":1,"clientName":"Rajesh Patel","company":"Patel Pharmaceuticals Pvt Ltd","content":"Honest Label has been our trusted partner for pharmaceutical labeling for over 5 years. Their attention to regulatory compliance and print quality is exceptional. The FDA-compliant labels they provide meet all our requirements.","imageUrl":null,"rating":5,"isActive":true,"displayOrder":1,"createdAt":"2026-01-03T12:37:27.235Z","updatedAt":null},{"id":2,"clientName":"Anita Sharma","company":"Gujarat Agro Industries","content":"We switched to Honest Label for our agricultural product labeling needs and have never looked back. Their weatherproof labels withstand harsh outdoor conditions perfectly. Great service and competitive pricing!","imageUrl":null,"rating":5,"isActive":true,"displayOrder":2,"createdAt":"2026-01-03T12:37:27.272Z","updatedAt":null},{"id":3,"clientName":"Vikram Singh","company":"AutoParts Manufacturing Co","content":"The automotive barcode labels from Honest Label have significantly improved our inventory tracking. They are oil-resistant and withstand the harsh manufacturing environment. Highly recommended for industrial applications.","imageUrl":null,"rating":5,"isActive":true,"displayOrder":3,"createdAt":"2026-01-03T12:37:27.288Z","updatedAt":null},{"id":4,"clientName":"Priya Mehta","company":"Mehta Cosmetics","content":"Beautiful transparent labels that give our cosmetic products a premium look. The team at Honest Label understood our branding requirements and delivered exactly what we envisioned. The waterproof finish is perfect for our bath products.","imageUrl":null,"rating":5,"isActive":true,"displayOrder":4,"createdAt":"2026-01-03T12:37:27.303Z","updatedAt":null},{"id":5,"clientName":"Suresh Kumar","company":"FreshFoods Packaging","content":"The food-grade labels from Honest Label meet all FDA requirements. Their freezer-grade labels stay perfectly attached even at -20°C. Excellent quality and timely delivery every time.","imageUrl":null,"rating":5,"isActive":true,"displayOrder":5,"createdAt":"2026-01-03T12:37:27.319Z","updatedAt":null},{"id":6,"clientName":"Deepak Joshi","company":"SecureTech Solutions","content":"We use Honest Label holographic security labels for our electronic products. The anti-counterfeiting features are top-notch, and they have helped us protect our brand from duplication. Professional service from start to finish.","imageUrl":null,"rating":5,"isActive":true,"displayOrder":6,"createdAt":"2026-01-03T12:37:27.335Z","updatedAt":null},{"id":7,"clientName":"Meena Agarwal","company":"Sparkle Jewellers","content":"The jewelry tags from Honest Label are elegant and functional. The butterfly fold design works perfectly for our rings and earrings. Great print quality that reflects our brand premium image.","imageUrl":null,"rating":4,"isActive":true,"displayOrder":7,"createdAt":"2026-01-03T12:37:27.351Z","updatedAt":null},{"id":8,"clientName":"Amit Desai","company":"Chemical Industries Gujarat","content":"GHS-compliant drum labels that withstand exposure to chemicals and outdoor elements. Honest Label team provided excellent guidance on regulatory requirements. Very satisfied with the durability and print clarity.","imageUrl":null,"rating":5,"isActive":true,"displayOrder":8,"createdAt":"2026-01-03T12:37:27.366Z","updatedAt":null}]